# ðŸ‡ºðŸ‡¸ English Version
- What is Pandas?

- Pandas is a Python library used for:

- Structured data handling

- Data cleaning

- Data manipulation

- Statistical analysis

In [5]:
#seris example :
# this is like list with  indexing 

import pandas as pd 
s = pd.Series([10,20,30])

In [6]:
s

0    10
1    20
2    30
dtype: int64

In [7]:
import pandas as pd

data = [10, 20, 30, 40]
s = pd.Series(data)

print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
# Custom Index Example
s = pd.Series([100, 200, 300], index=['a', 'b', 'c'])
print(s)

a    100
b    200
c    300
dtype: int64

In [9]:
s = pd.Series([100, 200, 300,500], index=['a', 'b', 'c','d'])
print(s)

a    100
b    200
c    300
d    500
dtype: int64

In [10]:
print(s['b']) # access any values  by index values 
print(s['d'])

200
500

In [11]:
# what is datafram : its like 2D  Tables , row+columns 
data = {
    "Name": ["Ramesh", "Suresh", "Aman"],
    "Age": [22, 23, 21],
    "Marks": [85, 90, 88]
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90
2    Aman   21     88

In [12]:
# column access :

print(df["Name"])

0    Ramesh
1    Suresh
2      Aman
Name: Name, dtype: object

In [13]:
print(df["Age"])

0    22
1    23
2    21
Name: Age, dtype: int64

In [14]:
print(df[["Name", "Marks"]])

     Name  Marks
0  Ramesh     85
1  Suresh     90
2    Aman     88

In [15]:
data1 = { 
     "name ": [ " ramesh ", "khushi ", " ajeet", "devansh ", "aman"],
     "Age":[21,20,21,22,23],
     "score" : [90,85,80,95,100]

}
df =pd.DataFrame(data1)

df

      name   Age  score
0   ramesh    21     90
1   khushi    20     85
2     ajeet   21     80
3  devansh    22     95
4      aman   23    100

In [16]:
print(df["name "])

0     ramesh
1     khushi
2       ajeet
3    devansh
4        aman
Name: name , dtype: object

In [17]:
print(df["score"])

0     90
1     85
2     80
3     95
4    100
Name: score, dtype: int64

In [20]:
# access multiple columns :
print(df[["Age","score"]])

   Age  score
0   21     90
1   20     85
2   21     80
3   22     95
4   23    100

In [24]:
print(df[[]])

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [28]:
print(df["score"].mean())
print(df["score"].max())
print(df["score"].min())

90.0
100
80

In [30]:
s1 = pd.Series([10,15,24,52,21])
s1

0    10
1    15
2    24
3    52
4    21
dtype: int64

In [31]:
s1 = pd.Series([10,21,45,24,58],index= ['a','b','c','d','e'])

In [32]:
s1

a    10
b    21
c    45
d    24
e    58
dtype: int64

In [39]:
record= {

     "name": ["ajeet","ramesh","khushi","tiwari","aman"],
     "age": [21,21,23,34,21],
     "score ": [ 90,90,40,90,80],
     "grade":[ 'A','B','c','D','E']

}
df= pd.DataFrame(record)
df

     name  age  score  grade
0   ajeet   21      90     A
1  ramesh   21      90     B
2  khushi   23      40     c
3  tiwari   34      90     D
4    aman   21      80     E

In [40]:
print(df["score "].mean)

<bound method Series.mean of 0    90
1    90
2    40
3    90
4    80
Name: score , dtype: int64>

In [41]:
print(df["score "].median)

<bound method Series.median of 0    90
1    90
2    40
3    90
4    80
Name: score , dtype: int64>

In [42]:
print(df["score "].max)

<bound method Series.max of 0    90
1    90
2    40
3    90
4    80
Name: score , dtype: int64>

In [43]:
print(df["score "].min)

<bound method Series.min of 0    90
1    90
2    40
3    90
4    80
Name: score , dtype: int64>

In [44]:
print(df["age"])

0    21
1    21
2    23
3    34
4    21
Name: age, dtype: int64

In [45]:
print(df["name"])

0     ajeet
1    ramesh
2    khushi
3    tiwari
4      aman
Name: name, dtype: object

In [46]:
import pandas as pd

data = {
    "Name": ["Ramesh", "Suresh", "Aman", "Priya"],
    "Age": [22, 23, 21, 24],
    "Marks": [85, 90, 88, 92]
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90
2    Aman   21     88
3   Priya   24     92

- DataFrame Inspection Tools
- head() â†’ first rows
- tail() â†’ last rows
- shape â†’ (rows, columns)
- info() â†’ data types + null values
- describe() â†’ statistics

In [47]:
# basic functionns :
df

     Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90
2    Aman   21     88
3   Priya   24     92

In [48]:
df.head()

     Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90
2    Aman   21     88
3   Priya   24     92

In [49]:
df.head(2)   # show the first rows :

     Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90

In [52]:
df.tail(2) # show the last rows :

    Name  Age  Marks
2   Aman   21     88
3  Priya   24     92

In [53]:
df.shape

(4, 3)

In [54]:
df.info # tell us count rows , data types ,mising values ;

<bound method DataFrame.info of      Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90
2    Aman   21     88
3   Priya   24     92>

In [56]:
df.describe() # show numeric statistical summery data only for columns :

             Age      Marks
count   4.000000   4.000000
mean   22.500000  88.750000
std     1.290994   2.986079
min    21.000000  85.000000
25%    21.750000  87.250000
50%    22.500000  89.000000
75%    23.250000  90.500000
max    24.000000  92.000000

In [57]:
 #columns selections  deep dive 
df["Age"]

0    22
1    23
2    21
3    24
Name: Age, dtype: int64

In [58]:
type(df["Age"])

pandas.core.series.Series

In [59]:
type(df["Age"])

pandas.core.series.Series

In [60]:
# row selections ( important  )  , loc (labal based selection )
#clabel mmeans -  index 
df.loc[0]

Name     Ramesh
Age          22
Marks        85
Name: 0, dtype: object

In [62]:
# multiple rows: 
df.loc[0:2]     # include the last index

     Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90
2    Aman   21     88

In [63]:
# iloc (position based selection )  , no include last index 
df.iloc[0]

Name     Ramesh
Age          22
Marks        85
Name: 0, dtype: object

In [64]:
df.iloc[0]

Name     Ramesh
Age          22
Marks        85
Name: 0, dtype: object

In [65]:
df.iloc[1, 2]

np.int64(90)

In [66]:
df_sorted = df.sort_values("Marks", ascending=False)
df_sorted.head(2)

     Name  Age  Marks
3   Priya   24     92
1  Suresh   23     90

In [67]:
df.sort_values("Marks", ascending=False).iloc[0:2]

     Name  Age  Marks
3   Priya   24     92
1  Suresh   23     90

# Boolean filtering & conditional selections :

In [68]:
import pandas as pd

data = {
    "Name": ["Ramesh", "Suresh", "Aman", "Priya","ajeet","khushi","tiwari","muskan","umra"],
    "Age": [22, 23, 21, 24,21,22,23,21,20],
    "Marks": [85, 90, 88, 92,94,45,57,58,85]
}

df = pd.DataFrame(data)

In [69]:
df

     Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90
2    Aman   21     88
3   Priya   24     92
4   ajeet   21     94
5  khushi   22     45
6  tiwari   23     57
7  muskan   21     58
8    umra   20     85

In [126]:
df.to_csv("output.csv",index= False)

In [70]:
df[df["Age"] > 22]

     Name  Age  Marks
1  Suresh   23     90
3   Priya   24     92
6  tiwari   23     57

In [72]:
df[df["Age"] < 22]

     Name  Age  Marks
2    Aman   21     88
4   ajeet   21     94
7  muskan   21     58
8    umra   20     85

In [73]:
# multiple condition 
df[(df["Age"] > 21) & (df["Marks"] > 85)]

     Name  Age  Marks
1  Suresh   23     90
3   Priya   24     92

In [74]:
df[(df["Age"] > 23) | (df["Marks"] > 90)]

    Name  Age  Marks
3  Priya   24     92
4  ajeet   21     94

In [75]:
high_performers = df[df["Marks"] > 85]

In [76]:
# specific columns 
df.loc[df["Marks"] > 85, ["Name", "Marks"]]

     Name  Marks
1  Suresh     90
2    Aman     88
3   Priya     92
4   ajeet     94

In [78]:
df[df["Name"].isin(["Ramesh", "Aman"])]   # check  multiple values : use isin()

     Name  Age  Marks
0  Ramesh   22     85
2    Aman   21     88

In [80]:
df[df["Age"].between(21, 23)] # its an clean way

     Name  Age  Marks
0  Ramesh   22     85
1  Suresh   23     90
2    Aman   21     88
4   ajeet   21     94
5  khushi   22     45
6  tiwari   23     57
7  muskan   21     58

In [81]:
df.query("Age > 22 and Marks > 85")

     Name  Age  Marks
1  Suresh   23     90
3   Priya   24     92

- GroupBy
- Aggregation
- Feature Engineering
- Transform
- Apply

In [82]:
# # group by :
# Split â†’ Apply â†’ Combine
# Used for category-wise analytics.
# means ; split data and then calculate 

import pandas as pd

data = {
    "Department": ["CSE", "CSE", "IT", "IT", "ECE", "ECE"],
    "Student": ["A", "B", "C", "D", "E", "F"],
    "Marks": [85, 90, 78, 88, 92, 70],
    "Salary": [800000, 900000, 600000, 750000, 950000, 500000]
}

df = pd.DataFrame(data)
df

  Department Student  Marks  Salary
0        CSE       A     85  800000
1        CSE       B     90  900000
2         IT       C     78  600000
3         IT       D     88  750000
4        ECE       E     92  950000
5        ECE       F     70  500000

In [83]:
# basics group by :
df.groupby("Department")["Marks"].mean()

Department
CSE    87.5
ECE    81.0
IT     83.0
Name: Marks, dtype: float64

In [84]:
# multiple group by :
df.groupby("Department")["Marks"].agg(["mean", "max", "min", "count"])

            mean  max  min  count
Department
CSE         87.5   90   85      2
ECE         81.0   92   70      2
IT          83.0   88   78      2

In [85]:
df.groupby("Department").agg({
    "Marks": ["mean", "max"],
    "Salary": "mean"
})

           Marks        Salary
            mean max      mean
Department
CSE         87.5  90  850000.0
ECE         81.0  92  725000.0
IT          83.0  88  675000.0

In [87]:
# feature engineering  with group by 
#agg â†’ group level result
# transform â†’ original shape maintain karta hai



df["Dept_Avg"] = df.groupby("Department")["Marks"].transform("mean")
df

  Department Student  Marks  Salary  Dept_Avg
0        CSE       A     85  800000      87.5
1        CSE       B     90  900000      87.5
2         IT       C     78  600000      83.0
3         IT       D     88  750000      83.0
4        ECE       E     92  950000      81.0
5        ECE       F     70  500000      81.0

In [88]:
df["Performance_vs_Dept"] = df["Marks"] - df["Dept_Avg"]

In [89]:
df

  Department Student  Marks  Salary  Dept_Avg  Performance_vs_Dept
0        CSE       A     85  800000      87.5                 -2.5
1        CSE       B     90  900000      87.5                  2.5
2         IT       C     78  600000      83.0                 -5.0
3         IT       D     88  750000      83.0                  5.0
4        ECE       E     92  950000      81.0                 11.0
5        ECE       F     70  500000      81.0                -11.0

In [91]:
 # apply ( advance lavel )
# when you can apply login  than apply ( apply method )

def grade(x):
    if x >= 90:
        return "A"
    elif x >= 80:
        return "B"
    else:
        return "C"

df["Grade"] = df["Marks"].apply(grade)

In [92]:
df

  Department Student  Marks  Salary  Dept_Avg  Performance_vs_Dept Grade
0        CSE       A     85  800000      87.5                 -2.5     B
1        CSE       B     90  900000      87.5                  2.5     A
2         IT       C     78  600000      83.0                 -5.0     C
3         IT       D     88  750000      83.0                  5.0     B
4        ECE       E     92  950000      81.0                 11.0     A
5        ECE       F     70  500000      81.0                -11.0     C

In [96]:
# Department wise top 2 students
df.iloc[2]

Department                 IT
Student                     C
Marks                      78
Salary                 600000
Dept_Avg                 83.0
Performance_vs_Dept      -5.0
Grade                       C
Name: 2, dtype: object

In [97]:
df_sorted = df.sort_values(["Department", "Marks"], ascending=[True, False])

top2 = df_sorted.groupby("Department").head(2)

top2

  Department Student  Marks  Salary  Dept_Avg  Performance_vs_Dept Grade
1        CSE       B     90  900000      87.5                  2.5     A
0        CSE       A     85  800000      87.5                 -2.5     B
4        ECE       E     92  950000      81.0                 11.0     A
5        ECE       F     70  500000      81.0                -11.0     C
3         IT       D     88  750000      83.0                  5.0     B
2         IT       C     78  600000      83.0                 -5.0     C

In [98]:
df.groupby("Department")["Marks"].rank(method="dense", ascending=False)

0    2.0
1    1.0
2    2.0
3    1.0
4    1.0
5    2.0
Name: Marks, dtype: float64

In [99]:
def grade(marks):
    if marks >= 90:
        return "A"
    elif marks >= 80:
        return "B"
    elif marks >= 70:
        return "C"
    else:
        return "D"

df["Grade"] = df["Marks"].apply(grade)

In [100]:
df

  Department Student  Marks  Salary  Dept_Avg  Performance_vs_Dept Grade
0        CSE       A     85  800000      87.5                 -2.5     B
1        CSE       B     90  900000      87.5                  2.5     A
2         IT       C     78  600000      83.0                 -5.0     C
3         IT       D     88  750000      83.0                  5.0     B
4        ECE       E     92  950000      81.0                 11.0     A
5        ECE       F     70  500000      81.0                -11.0     C

In [101]:
summary = df.groupby("Department").agg({
    "Marks": ["mean", "max", "min"],
    "Salary": ["mean", "max"],
    "Student": "count"
})

summary

           Marks            Salary         Student
            mean max min      mean     max   count
Department
CSE         87.5  90  85  850000.0  900000       2
ECE         81.0  92  70  725000.0  950000       2
IT          83.0  88  78  675000.0  750000       2

# What is Pivot Table?

- A way to summarize data into a matrix format.

- Rows â†’ index
- Columns â†’ columns
- Values â†’ aggregated metric

In [102]:
# data summery convert into tables :
# example :
import pandas as pd

data = {
    "Department": ["CSE","CSE","IT","IT","ECE","ECE"],
    "Gender": ["Male","Female","Male","Female","Male","Female"],
    "Marks": [85,90,78,88,92,70],
    "Salary": [800000,900000,600000,750000,950000,500000]
}

df = pd.DataFrame(data)
df

  Department  Gender  Marks  Salary
0        CSE    Male     85  800000
1        CSE  Female     90  900000
2         IT    Male     78  600000
3         IT  Female     88  750000
4        ECE    Male     92  950000
5        ECE  Female     70  500000

In [103]:
# Basic Pivot
# Department vs Gender â†’ Average Marks
pd.pivot_table(df,
               values="Marks",
               index="Department",
               columns="Gender",
               aggfunc="mean")

Gender      Female  Male
Department
CSE           90.0  85.0
ECE           70.0  92.0
IT            88.0  78.0

In [104]:
# multiple agg
pd.pivot_table(df,
               values="Marks",
               index="Department",
               columns="Gender",
               aggfunc=["mean","max"])

             mean          max
Gender     Female  Male Female Male
Department
CSE          90.0  85.0     90   85
ECE          70.0  92.0     70   92
IT           88.0  78.0     88   78

In [106]:
pd.pivot_table(df,
               values="Marks",
               index="Department",
               columns="Gender",
               aggfunc=["mean","max","min","count","median","std","sum"])

             mean          max         min       count      median        \
Gender     Female  Male Female Male Female Male Female Male Female  Male
Department
CSE          90.0  85.0     90   85     90   85      1    1   90.0  85.0
ECE          70.0  92.0     70   92     70   92      1    1   70.0  92.0
IT           88.0  78.0     88   78     88   78      1    1   88.0  78.0

              sum
Gender     Female Male
Department
CSE            90   85
ECE            70   92
IT             88   78

In [107]:
pd.pivot_table(df,
               values="Marks",
               index="Department",
               columns="Gender",
               aggfunc="mean",
               margins=True)

Gender         Female  Male        All
Department
CSE         90.000000  85.0  87.500000
ECE         70.000000  92.0  81.000000
IT          88.000000  78.0  83.000000
All         82.666667  85.0  83.833333

In [ ]:
# its provide the overall avg :


pd.pivot_table(df,
               values="Marks",
               index="Department",
               columns="Gender",
               aggfunc=["mean","median","min","std","sum",],
               margins=True)

                 mean                  median                min           \
Gender         Female  Male        All Female  Male   All Female Male All
Department
CSE         90.000000  85.0  87.500000   90.0  85.0  87.5     90   85  85
ECE         70.000000  92.0  81.000000   70.0  92.0  81.0     70   92  70
IT          88.000000  78.0  83.000000   88.0  78.0  83.0     88   78  78
All         82.666667  85.0  83.833333   88.0  85.0  86.5     70   78  70

              sum
Gender     Female Male  All
Department
CSE            90   85  175
ECE            70   92  162
IT             88   78  166
All           248  255  503

# MERGE / JOIN / CONCAT

In [111]:
# merge :Used to combine DataFrames based on a common key.
df_students = pd.DataFrame({
    "Student_ID": [1,2,3,4],
    "Name": ["A","B","C","D"],
    "Department": ["CSE","IT","ECE","CSE"]
})

In [112]:
df_students

   Student_ID Name Department
0           1    A        CSE
1           2    B         IT
2           3    C        ECE
3           4    D        CSE

In [113]:
df_salary = pd.DataFrame({
    "Student_ID": [1,2,4,5],
    "Salary": [800000,600000,900000,500000]
})

In [114]:
df_salary

   Student_ID  Salary
0           1  800000
1           2  600000
2           4  900000
3           5  500000

In [116]:
pd.merge(df_students, df_salary, on="Student_ID", how="inner")  # by default inner join 


# common columns student_id

   Student_ID Name Department  Salary
0           1    A        CSE  800000
1           2    B         IT  600000
2           4    D        CSE  900000

In [117]:
pd.merge(df_students, df_salary, on="Student_ID", how="left")

   Student_ID Name Department    Salary
0           1    A        CSE  800000.0
1           2    B         IT  600000.0
2           3    C        ECE       NaN
3           4    D        CSE  900000.0

In [120]:
pd.merge(df_students, df_salary, on="Student_ID", how="right",)

   Student_ID Name Department  Salary
0           1    A        CSE  800000
1           2    B         IT  600000
2           4    D        CSE  900000
3           5  NaN        NaN  500000

In [128]:
df.to_csv("data.csv",index=False)

In [138]:
df.to_csv(
    "output1.csv",
    index=False,
    encoding="utf-8",
    sep=","
)

#  â€“files load  Setup

- CSV load karna
- Excel load karna
- SQL se data lana
- JSON handle karna
- Parquet read karna

In [139]:
import pandas as pd
import numpy as np

data = {
    "Emp_ID": [101,102,103,104,105],
    "Name": ["Amit","Neha","Rahul","Priya","Vikas"],
    "Department": ["IT","HR","IT","Finance","HR"],
    "Salary": [70000,50000,80000,np.nan,52000]
}

df = pd.DataFrame(data)

In [142]:
df.to_csv("employee.csv", index=False)

In [146]:
df.to_excel("employee.xlsx", index=False,)

In [147]:
df.to_json("employee.json", orient="records", indent=4)

In [152]:
df.to_parquet("employee.parquet", index=False)

In [149]:
df_csv = pd.read_csv("employee.csv")
df_csv.head()

   Emp_ID   Name Department   Salary
0     101   Amit         IT  70000.0
1     102   Neha         HR  50000.0
2     103  Rahul         IT  80000.0
3     104  Priya    Finance      NaN
4     105  Vikas         HR  52000.0

In [154]:
df_csv.info()
df_csv.isnull().sum()
df_csv.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Emp_ID      5 non-null      int64
 1   Name        5 non-null      object
 2   Department  5 non-null      object
 3   Salary      4 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

           Emp_ID        Salary
count    5.000000      4.000000
mean   103.000000  63000.000000
std      1.581139  14468.356276
min    101.000000  50000.000000
25%    102.000000  51500.000000
50%    103.000000  61000.000000
75%    104.000000  72500.000000
max    105.000000  80000.000000

In [150]:
df_excel = pd.read_excel("employee.xlsx")
df_excel.head()

   Emp_ID   Name Department   Salary
0     101   Amit         IT  70000.0
1     102   Neha         HR  50000.0
2     103  Rahul         IT  80000.0
3     104  Priya    Finance      NaN
4     105  Vikas         HR  52000.0

In [156]:
df_csv.info()
df_csv.isnull().sum()
df_csv.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Emp_ID      5 non-null      int64
 1   Name        5 non-null      object
 2   Department  5 non-null      object
 3   Salary      4 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

           Emp_ID        Salary
count    5.000000      4.000000
mean   103.000000  63000.000000
std      1.581139  14468.356276
min    101.000000  50000.000000
25%    102.000000  51500.000000
50%    103.000000  61000.000000
75%    104.000000  72500.000000
max    105.000000  80000.000000

In [151]:
df_json = pd.read_json("employee.json")
df_json.head()

   Emp_ID   Name Department   Salary
0     101   Amit         IT  70000.0
1     102   Neha         HR  50000.0
2     103  Rahul         IT  80000.0
3     104  Priya    Finance      NaN
4     105  Vikas         HR  52000.0

In [155]:
df_parquet = pd.read_parquet("employee.parquet")
df_parquet.head()

   Emp_ID   Name Department   Salary
0     101   Amit         IT  70000.0
1     102   Neha         HR  50000.0
2     103  Rahul         IT  80000.0
3     104  Priya    Finance      NaN
4     105  Vikas         HR  52000.0

# Missing Values (deep level)
- 2ï¸. Duplicates remove
- 3ï¸. Data type conversion
- 4ï¸. Outlier detection
- 5ï¸. Column rename / drop
- 6ï¸. Inconsistent data clean

In [158]:
import pandas as pd
import numpy as np

data = {
    "Emp_ID": [101,102,103,104,105,105,106,107,108,109],
    "Name": [" Amit","Neha ","RAHUL","Priya","Vikas","Vikas","Anjali","Rohit","Sneha","Arjun"],
    "Department": ["IT","hr","IT ","Finance","HR","HR","IT","finance","IT","HR"],
    "Salary": ["70000","50000","80000","NaN","52000","52000","75000","9000000","72000","51000"],
    "Experience": [3,2,5,4,2,2,6,8,4,None]
}

df = pd.DataFrame(data)

df

   Emp_ID    Name Department   Salary  Experience
0     101    Amit         IT    70000         3.0
1     102   Neha          hr    50000         2.0
2     103   RAHUL        IT     80000         5.0
3     104   Priya    Finance      NaN         4.0
4     105   Vikas         HR    52000         2.0
5     105   Vikas         HR    52000         2.0
6     106  Anjali         IT    75000         6.0
7     107   Rohit    finance  9000000         8.0
8     108   Sneha         IT    72000         4.0
9     109   Arjun         HR    51000         NaN

In [159]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Emp_ID      10 non-null     int64
 1   Name        10 non-null     object
 2   Department  10 non-null     object
 3   Salary      10 non-null     object
 4   Experience  9 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 532.0+ bytes

In [160]:
df.isnull().sum()

Emp_ID        0
Name          0
Department    0
Salary        0
Experience    1
dtype: int64

In [162]:
df.describe(include='all')

            Emp_ID   Name Department Salary  Experience
count    10.000000     10         10     10    9.000000
unique         NaN      9          6      9         NaN
top            NaN  Vikas         IT  52000         NaN
freq           NaN      2          3      2         NaN
mean    105.000000    NaN        NaN    NaN    4.000000
std       2.581989    NaN        NaN    NaN    2.061553
min     101.000000    NaN        NaN    NaN    2.000000
25%     103.250000    NaN        NaN    NaN    2.000000
50%     105.000000    NaN        NaN    NaN    4.000000
75%     106.750000    NaN        NaN    NaN    5.000000
max     109.000000    NaN        NaN    NaN    8.000000

In [163]:
# remove duplicate:
df = df.drop_duplicates()

In [164]:
df

   Emp_ID    Name Department   Salary  Experience
0     101    Amit         IT    70000         3.0
1     102   Neha          hr    50000         2.0
2     103   RAHUL        IT     80000         5.0
3     104   Priya    Finance      NaN         4.0
4     105   Vikas         HR    52000         2.0
6     106  Anjali         IT    75000         6.0
7     107   Rohit    finance  9000000         8.0
8     108   Sneha         IT    72000         4.0
9     109   Arjun         HR    51000         NaN

In [ ]:
# specific columns 
df = df.drop_duplicates(subset="Emp_ID") # remove the extra rows 
# why use : Duplicate data â†’ wrong aggregation â†’ wrong salary average â†’ wrong business decision.Duplicate data â†’ wrong aggregation â†’ wrong salary average â†’ wrong business decision.

In [166]:
df

   Emp_ID    Name Department   Salary  Experience
0     101    Amit         IT    70000         3.0
1     102   Neha          hr    50000         2.0
2     103   RAHUL        IT     80000         5.0
3     104   Priya    Finance      NaN         4.0
4     105   Vikas         HR    52000         2.0
6     106  Anjali         IT    75000         6.0
7     107   Rohit    finance  9000000         8.0
8     108   Sneha         IT    72000         4.0
9     109   Arjun         HR    51000         NaN

In [ ]:
 # Trim Spaces
df["Name"] = df["Name"].str.strip()  # remove left right space ,"Amit" â‰  " Amit"

In [168]:
df

   Emp_ID    Name Department   Salary  Experience
0     101    Amit         IT    70000         3.0
1     102    Neha         hr    50000         2.0
2     103   RAHUL        IT     80000         5.0
3     104   Priya    Finance      NaN         4.0
4     105   Vikas         HR    52000         2.0
6     106  Anjali         IT    75000         6.0
7     107   Rohit    finance  9000000         8.0
8     108   Sneha         IT    72000         4.0
9     109   Arjun         HR    51000         NaN

In [169]:
# fix casing 
df["Department"] = df["Department"].str.upper()

In [170]:
df

   Emp_ID    Name Department   Salary  Experience
0     101    Amit         IT    70000         3.0
1     102    Neha         HR    50000         2.0
2     103   RAHUL        IT     80000         5.0
3     104   Priya    FINANCE      NaN         4.0
4     105   Vikas         HR    52000         2.0
6     106  Anjali         IT    75000         6.0
7     107   Rohit    FINANCE  9000000         8.0
8     108   Sneha         IT    72000         4.0
9     109   Arjun         HR    51000         NaN

In [173]:
df["Salary"] = pd.to_numeric(df["Salary"], errors="coerce") # convert  string to number ,errors="coerce" ,  invaild value ->NaN

In [172]:
df

   Emp_ID    Name Department     Salary  Experience
0     101    Amit         IT    70000.0         3.0
1     102    Neha         HR    50000.0         2.0
2     103   RAHUL        IT     80000.0         5.0
3     104   Priya    FINANCE        NaN         4.0
4     105   Vikas         HR    52000.0         2.0
6     106  Anjali         IT    75000.0         6.0
7     107   Rohit    FINANCE  9000000.0         8.0
8     108   Sneha         IT    72000.0         4.0
9     109   Arjun         HR    51000.0         NaN

In [175]:
df["Experience"].fillna(df["Experience"].median(), inplace=True)

C:\Users\rames\AppData\Local\Temp\ipykernel_25316\4041168258.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Experience"].fillna(df["Experience"].median(), inplace=True)

# Statistics (Real Analysis)

-  Mean / Median / Mode
-  Variance / Standard Deviation
-  Correlation
-   Covariance
-  Distribution understanding

In [176]:
df

   Emp_ID    Name Department     Salary  Experience
0     101    Amit         IT    70000.0         3.0
1     102    Neha         HR    50000.0         2.0
2     103   RAHUL        IT     80000.0         5.0
3     104   Priya    FINANCE        NaN         4.0
4     105   Vikas         HR    52000.0         2.0
6     106  Anjali         IT    75000.0         6.0
7     107   Rohit    FINANCE  9000000.0         8.0
8     108   Sneha         IT    72000.0         4.0
9     109   Arjun         HR    51000.0         4.0

In [ ]:
df["Salary"].mean()
df["Salary"].median()
df["Salary"].var()
df["Salary"].std()
df["Department"].mode()

np.float64(71000.0)

In [ ]:
# Mean â†’ average

# Median â†’ middle value (outlier resistant)

# Mode â†’ most frequent value

np.float64(9981014500000.0)

In [182]:
df[["Salary", "Experience"]].corr()

              Salary  Experience
Salary      1.000000    0.739959
Experience  0.739959    1.000000

In [183]:
# Meaning:

# +1 â†’ strong positive relation

# 0 â†’ no relation

# -1 â†’ negative relation

In [184]:
df[["Salary", "Experience"]].cov()

                  Salary    Experience
Salary      9.981014e+12  4.799071e+06
Experience  4.799071e+06  3.694444e+00

In [185]:
import pandas as pd
import numpy as np

np.random.seed(42)

n = 200

data = {
    "Experience": np.random.randint(1, 15, n),
    "Overtime_Hours": np.random.normal(20, 5, n),
    "Training_Hours": np.random.normal(40, 10, n),
}

df = pd.DataFrame(data)

# Salary correlated with experience
df["Salary"] = df["Experience"] * 8000 + np.random.normal(0, 5000, n)

# Performance correlated with training & experience
df["Performance_Score"] = (
    df["Experience"] * 2
    + df["Training_Hours"] * 0.3
    + np.random.normal(0, 5, n)
)

df.head()

,Experience,Overtime_Hours,Training_Hours,Salary,Performance_Score
0,7,24.577011,38.482149,52767.135579,24.343018
1,4,21.643756,45.883172,26592.259982,19.890848
2,13,17.351199,42.809919,112435.708175,42.397775
3,11,22.566337,33.773005,92408.198785,34.353218
4,8,20.485388,37.918777,63960.136793,25.570802

In [186]:

df.describe()

,Experience,Overtime_Hours,Training_Hours,Salary,Performance_Score
count,200.000000,200.000000,200.000000,200.000000,200.000000
mean,7.930000,20.162210,40.347313,63190.314045,28.347496
std,4.003152,5.105364,9.532421,32203.022672,9.827634
min,1.000000,3.793663,16.980788,4047.627723,4.804411
25%,4.750000,16.404653,33.947806,37487.820411,21.914850
50%,8.000000,20.379191,40.089181,64362.210511,28.148409
75%,12.000000,23.263409,46.514501,91774.395969,35.627168
max,14.000000,39.263657,70.788808,124866.799016,52.638349

In [187]:
df.corr()

,Experience,Overtime_Hours,Training_Hours,Salary,Performance_Score
Experience,1.000000,-0.029952,-0.049792,0.987486,0.824742
Overtime_Hours,-0.029952,1.000000,-0.047037,-0.050121,-0.071996
Training_Hours,-0.049792,-0.047037,1.000000,-0.041463,0.247848
Salary,0.987486,-0.050121,-0.041463,1.000000,0.826166
Performance_Score,0.824742,-0.071996,0.247848,0.826166,1.000000

# Time Series (Very Important)

### date_range samajhna
2ï¸. DateTime index ka importance
3ï¸. Resampling
4ï¸. Rolling mean
5ï¸. Shift
6ï¸. Lag feature
7ï¸. Timezone
8ï¸. Timedelta

In [188]:
import pandas as pd
import numpy as np

# Date create
dates = pd.date_range(start="2023-01-01", periods=12, freq="M")

# Random sales data
sales = np.random.randint(1000, 5000, 12)

# DataFrame create
df = pd.DataFrame({
    "Date": dates,
    "Sales": sales
})

# Date ko index bana do
df.set_index("Date", inplace=True)

df

C:\Users\rames\AppData\Local\Temp\ipykernel_25316\16269259.py:5: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.date_range(start="2023-01-01", periods=12, freq="M")

            Sales
Date
2023-01-31   2772
2023-02-28   2312
2023-03-31   2285
2023-04-30   1215
2023-05-31   4218
2023-06-30   3383
2023-07-31   4239
2023-08-31   3139
2023-09-30   3400
2023-10-31   3618
2023-11-30   4642
2023-12-31   3863

In [ ]:
df.loc["2023-03"]
df.loc["2023-03":"2023-06"] # Time range select karna.

            Sales
Date
2023-03-31   1362
2023-04-30   3604
2023-05-31   4416
2023-06-30   2716

In [ ]:
df.resample("Q").sum()
# 

# Frequency change karna.
# Real life:
# Monthly data ko quarterly report banana.

C:\Users\rames\AppData\Local\Temp\ipykernel_25316\547106500.py:1: FutureWarning: 'Q' is deprecated and will be removed in a future version, please use 'QE' instead.
  df.resample("Q").sum()

            Sales
Date
2023-03-31   7894
2023-06-30  10736
2023-09-30   4738
2023-12-31   9906

In [ ]:
df["Rolling_3"] = df["Sales"].rolling(3).mean()   

# Last 3 months ka average nikalna.
# Real life:
# Trend smooth karna.

In [193]:
df

            Sales    Rolling_3
Date
2023-01-31   2704          NaN
2023-02-28   3828          NaN
2023-03-31   1362  2631.333333
2023-04-30   3604  2931.333333
2023-05-31   4416  3127.333333
2023-06-30   2716  3578.666667
2023-07-31   2193  3108.333333
2023-08-31   1355  2088.000000
2023-09-30   1190  1579.333333
2023-10-31   4738  2427.666667
2023-11-30   3469  3132.333333
2023-12-31   1699  3302.000000

In [195]:
df["Previous_Month"] = df["Sales"].shift(1)

In [197]:
df # Pichhle month ki value lana.

            Sales    Rolling_3  Previous_Month
Date
2023-01-31   2704          NaN             NaN
2023-02-28   3828          NaN          2704.0
2023-03-31   1362  2631.333333          3828.0
2023-04-30   3604  2931.333333          1362.0
2023-05-31   4416  3127.333333          3604.0
2023-06-30   2716  3578.666667          4416.0
2023-07-31   2193  3108.333333          2716.0
2023-08-31   1355  2088.000000          2193.0
2023-09-30   1190  1579.333333          1355.0
2023-10-31   4738  2427.666667          1190.0
2023-11-30   3469  3132.333333          4738.0
2023-12-31   1699  3302.000000          3469.0

In [198]:
df["Growth_%"] = df["Sales"].pct_change() * 100

In [200]:
df # Month to month percentage growth.

            Sales    Rolling_3  Previous_Month    Growth_%
Date
2023-01-31   2704          NaN             NaN         NaN
2023-02-28   3828          NaN          2704.0   41.568047
2023-03-31   1362  2631.333333          3828.0  -64.420063
2023-04-30   3604  2931.333333          1362.0  164.610866
2023-05-31   4416  3127.333333          3604.0   22.530522
2023-06-30   2716  3578.666667          4416.0  -38.496377
2023-07-31   2193  3108.333333          2716.0  -19.256259
2023-08-31   1355  2088.000000          2193.0  -38.212494
2023-09-30   1190  1579.333333          1355.0  -12.177122
2023-10-31   4738  2427.666667          1190.0  298.151261
2023-11-30   3469  3132.333333          4738.0  -26.783453
2023-12-31   1699  3302.000000          3469.0  -51.023350

In [201]:
df["Month"] = df.index.month
df["Year"] = df.index.year

In [202]:
df

            Sales    Rolling_3  Previous_Month    Growth_%  Month  Year
Date
2023-01-31   2704          NaN             NaN         NaN      1  2023
2023-02-28   3828          NaN          2704.0   41.568047      2  2023
2023-03-31   1362  2631.333333          3828.0  -64.420063      3  2023
2023-04-30   3604  2931.333333          1362.0  164.610866      4  2023
2023-05-31   4416  3127.333333          3604.0   22.530522      5  2023
2023-06-30   2716  3578.666667          4416.0  -38.496377      6  2023
2023-07-31   2193  3108.333333          2716.0  -19.256259      7  2023
2023-08-31   1355  2088.000000          2193.0  -38.212494      8  2023
2023-09-30   1190  1579.333333          1355.0  -12.177122      9  2023
2023-10-31   4738  2427.666667          1190.0  298.151261     10  2023
2023-11-30   3469  3132.333333          4738.0  -26.783453     11  2023
2023-12-31   1699  3302.000000          3469.0  -51.023350     12  2023

# Text Processing (Very Important in Real Data)